{ "Technical Skills: ": {"Database": "Oracle 12C, 11G, 10G, 9i, 8i, 8, 7.3.,MS SQL 2000,2005,2008, SAP HANA 1.0,2.0,HANA XSA,MS Access,PostgreSQL, MySQL", 
"Programming Languages:":"Oracle Forms 6i, Oracle Forms 11g,Oracle Forms 12C,  PL/SQL, VB.NET, C#, Javascript, JSON, XML, VBA,REST, HTML5, ASP, ASP.NET,React, VB6, Delphi, Java. ",
"Reporting Technologies:":"Oracle Reports 6i, Oracle Reports 11g, SAP Business Objects, Crystal Reports, Active JS, PL/PDF, SAP Analytics Cloud(SAC)..",
"ETL Tools:":"Oracle Data Integrator (ODI), Informatica, SAP Analytics Cloud(SAC).",
"Cloud Platform" :"Microsoft Azure, SAP Analytics Cloud(SAC).",
"Business Objects/Intelligence Tools": "SAP HANA Studio, SAP Web IDE for SAP HANA, SAP Analytics Cloud(SAC),SAP Business Objects, Crystal Reports, Universe Designer XI, Web Intelligence XI, Live Office, Query as web service, Import Wizard, Xcelsius InfoView/Launch pad, Central Management Console, Web Intelligence, Universe Design Tool, WEBI Rich Client, Business Explorer.", 
"Web Servers": "Oracle Weblogic 11g (10.3.6),IIS6.0, Tomcat, Apache.", "Operating System": "Unix, Solaris, Linux, Windows 2012, Windows NT Server, Windows 8,7 Vista, Windows XP, Windows ME, Windows 95, 98, MS-Dos 6.2.",
"Other Software Tools": "MS Office (MS Access, MS Outlook, Word, Excel, PowerPoint,), MS Project, Erwin, MS Visio., Bit Bucket, SVN, PL/SQL Developer, Toad, Jira, Source Tree, GitOra, Docker,SQL Developer, Toad.",
"Project Reports":"Budget summary and Details Reports, Contract summary Report, Cost and Purchasing reports, job expense report, Labour Reports, Billing vs Cost, Sales and Cost Activity etc. ",
"Analytical Reports":"Cost Code Analysis, Budget variance, Project Margin Summary , Work in progress(WIP), Complete Contract Analysis, Projected WIP, Project  Profitability, Projected Cost Summary, Field Production Rate Variance, Project Dashboard etc.",
"AR Reports":"AR Aging Detail and Summary, Customer Balance Detail, AR Statement, Pending Invoice, AR Trial Balance, AR Collections etc.",
"AP Reports":"AP Aging Detail and Summary, Vendor Balance Detail,  Vendor Tax Summary, PO/Commitment cost, AP Cost Allocation etc.",
"Payroll Reports":"Payroll Payment Details, Payroll item details, employees not worked, current employee statistics, Employee stub summary, union Fringe Summary etc.",
"Financial Reports":"Balance Sheet, Trial Balance, Profit and Loss, Cash Flow Statement, Sales tax, GL Audit Trial etc.",
"Inventory Reports":"Inventory Activity, Inventory Levels , Stock Transfer, Purchase Qty, Inventory Sign out Qty, Crew Sign out Qty etc.",
"Miscellaneous Reports":"Cheque, invoices, bills , budget, Work order reports etc."
}, 
  "20+ years of experience in Analysis, Business Intelligence, Report/Dashboard, software development Database Development, Data Modeling, ETL, Data Warehousing and Technical Support across various industries.": "", 
  "Master of Science (MS) in Information Technology, SAP Business Objects Certified, Oracle Certified Professional 11g and successfully completed SAP Analytics Cloud and HANA training": "",
  "Over 15+ Years of experience in PLSQL.": "",
  "Expert in creating Stories, Models and Analytics application while using SAP Analytics Cloud.": "", 
  "Experiences in SAC security. Setting up teams, roles and user creations.": "", 
  "Proven experience in creating HANA calculation views for various reporting tools SAC, Power BI and Webi(Web intelligence).": "", 
  "Experienced in managing the Business objects, SAC, users, teams and groups (security), LCM and content network": "", 
  "Expert in various optimization techniques, including maintaining/creating indexes, normalizing/denormalizing data, creating materialized views, optimizing joins, adding pre-compiler hints, and eliminating redundant table scans to ensure maximum query efficiency.": "", 
  "Worked with various data sets and created Financial Reports, AP Reports,AR Reports, Analytical Reports, Project Reports, and Inventory Reports etc. ": "", 
  "Developed and maintained Multiple Dashboard and reports for key project metrics such as Work in progress, cost code Analysis, Budget  vs Actual Variance, job dashboard etc. to assess the performance, progress, and success of a project. ": "", 
  "Specialized in gathering client requirements and delivering tailored solutions.": "", 
  "Experienced to lead teams in designing database schemas, creating application logic, and developing UI interfaces and components, ensuring timely delivery and adherence to specifications.": "", 
  "Expert in gathering business and function requirements, collaborated with support staff, product owners, and management to document software requirements, create product plans, and provide realistic timelines and effort estimates for each solution.": "", 
  "Extensive hands-on experience with multiple Oracle versions, including 6i, 9i, 10g, 11g, and 12c, Oracle (PL/SQL) and Microsoft SQL Server (T-SQL).": "", 
  "Proficient with tools such as RMAN and Oracle Enterprise Manager (OEM), with experience managing database data files, tablespaces, data files, and creating import/export scripts.": "", 
  "Skilled in designing and deploying reports across various platforms, and developing user interfaces for data entry and review.": "", 
  "Skilled in data migration and ETL processes, working with diverse data sources to transfer and transform data between databases.": "", 
  "Designed and implemented ELT processes using Oracle Data Integrator (ODI) for seamless data migration between disparate systems.": "", 
  "Excellent communication, presentation and interpersonal skills.": "", 
  "to handle multiple tasks and work independently as well as a team member.": "", 
  "Quick learner and adapt easily to new environment and situation, communicate technical support; knowledge to the team and end users at all levels.": ""
}