{ "Technical Skills: ": {"Database": "Oracle 12C, 11G, 10G, 9i, 8i, 8, 7.3.,MS SQL 2000,2005,2008,MS Access,PostgreSQL, MySQL", 
"Programming Languages:":"Oracle Forms 6i, Oracle Forms 11g,Oracle Forms 12C, VB.NET, C#, Javascript, JSON, XML, VBA, ",
"Reporting Technologies:":"Oracle Reports 6i, Oracle Reports 11g, SAP Business Objects, Crystal Reports, Active JS, PL/PDF.",
"ETL Tools:":"Oracle Data Integrator (ODI), Informatica, SAP BO",
"Business Objects/Intelligence Tools": "Business Objects XI 4.0/3.1/R2/6.5, Crystal Enterprise 9,Crystal Reports2008,Crystal report 2011 Information Design tool, Universe Designer XI, Web Intelligence XI, Live Office, Query as web service, Import Wizard, Xcelsius InfoView/Launch pad, Central Management Console, Web Intelligence, Universe Design Tool, WEBI Rich Client, Business Explorer", 
"Web Servers": "Oracle Weblogic 11g (10.3.6),IIS6.0, Tomcat.", "Operating System": "Unix, Solaris, Linux, Windows 2012, Windows NT Server, Windows 8,7 Vista, Windows XP, Windows ME, Windows 95, 98, MS-Dos 6.2.",
"Other Software Tools": "MS Office (MS Access, MS Outlook, Word, Excel, PowerPoint,), MS Project, Erwin, MS Visio., Bit Bucket, SVN, PL/SQL Developer, Toad, Jira, Source Tree, GitOra, Docker,SQL Developer, Toad."},
  "Over 20+ years of professional experience in Analysis and software Design and development.": "", 
  "Master of Science (MS) in Information Technology, Oracle 11g R2 Certified Professional (OCP), SAP Business Objects Certified.(WEBI), Microsoft Certified Professional (Visual Basic 6) (MCP).": "",
  "Over 10+ Years of experience in PLSQL.": "",
  "Skilled in data migration and ETL processes, working with diverse data sources to transfer and transform data between databases.":"",
  "Design and implement ELT processes using Oracle Data Integrator (ODI) for seamless data migration between disparate systems.":"",
  "Over 5+ years of experience in Business Intelligence using SAP Business Objects XI-R3.1/R2/6.x with Info view, BI Launch pad, Web Intelligence, Data Integrator & Quality, Webi Rich Client, Desktop Intelligence, Crystal Reports 9/10/XI/2008/2011 Xcelsius 4.5/2008, Dashboard, Central Management Console (CMC), Central Management Server (CMS), Central Configuration Management (CCM), Query as a Web Service, Live Office, Business Explorer/Polestar XI 3.1, Publishing Wizard, Import Wizard and Report Conversion tool.": "",
  "Proficient in using Business Objects Tools Desktop Intelligence, Web-Intelligence, Info View / BI Launch Pad, Universe Designer / Information Designer, Central Management Console, Live Office, Query as a Web Service, Dashboard and Crystal Reports.": "",
  "Worked on Business Objects XI, 3.x and SAP Business Object 4.0.": "",
  "Expert in planning, designing, developing, modifying, updating, maintaining and distributing Universes and Reports.": "",
  "Detail oriented and Expertise in Universe designing, developing and generating complex, Adhoc, dashboard, Static Reports.": "",
  "Developed Universes using Business Objects Designer -Universe Methodology involving the creation of underlying database structure, resolving the loops, creating classes & objects, conditions & joins and finally testing the integrity of the Universe.": "",
  "Extensively used Business Objects reporting functionalities such as Drilling methodology Filters, Ranking, Sections, Graphs and Breaks.": "",
  "Proficiency in Scheduling, Publishing and Distribution of Business Objects documents": "",
  "Ability to work on own initiative or as part of a team, backed by excellent organizational and communication skills along with the capability to solve problems as they arise.": "",
  "Ability to handle multiple tasks and work independently as well as a team member.": "",
  "Prepared Technical specifications for the development of Universes and Report.": "",
  "Designed, Developed and implemented Asp.net web pages e-commerce applications while using C# as scripting language.": "",
  "Designed, Developed and implemented internal ASP web pages for employees to see their information (like Personnel information, salary, leave, allowances etc) using VBScript.": ""
}