{
    "Senior End-to-End Software Developer:Aug 2015 to Current,Plexxis Software:Brampton, Canada": ["Participate in the creation of a comprehensive end-to-end solution for the new features to be implemented in the Plexxis ERP.", 
"Provides user support and enhancements to in-house developed ERP application. The application was developed using Oracle Forms, Report and PL/SQL stored procedures, database triggers, packages and PLPDF Library.",
"Design and Develop PDF Reports using PL/PDF Reporter Libraries.",
"Create and fill PDF, Word and Excel document using PL/PLDF Toolkit Libraries.",
"Excel imports are developed to allow user flexibility for ad hoc reporting.",
"Develop and maintain Email Schedule reports procdures and jobs.",
"Created PL/SQL packages to import and process client PDFs containing billing and purchasing information. Developed a user interface in Oracle Forms to allow users to upload files and select the appropriate PDF template for processing.",
"Write SQL queries and Create/Modify Oracle database objects and program units using ORACLE SQL & PL/SQL.",
"Designed, developed, and maintained PL/SQL stored procedures, functions, and triggers for enterprise applications. ",
"Optimized complex queries for improved performance and reduced execution time.", 
"Automated data migration and reporting tasks using PL/SQL scripts, reducing manual efforts. ",
"Wrote efficient data validation checks to ensure data integrity and consistency across the system.", 
"Conducted performance tuning and database optimization to enhance overall system performance.",
"Develop new forms & reports using Oracle Forms11g and Oracle Reports and integrate them in the existing ERP system.",
"Use PL/SQL cursors, tables to process large volume of data utilizing bulk collect for mass update to improve performance.",
"Collaborated with payroll specialists to gather requirements for state tax filings, generating a range of files such as DE9C, 1099, T4 XML, and W2. Designed Oracle Forms interfaces for users to specify export parameters and generate these files.",
"Data related issues are also reviewed, provide script for data fix for resolution and fix the root cause of the problem by reviewing the back end database procedures and triggers or Forms code that may have resulted in bad data.",
"Ensure design leverages existing reusable components and has traceability to business requirements.",
"Designed and implemented Active JS reports for the ERP system, creating a NODE service to gather data into JSON format from Oracle, and using REACT with Active JS libraries to build robust ERP reports.",
"Overhauled the error handling across the ERP system by creating Oracle Forms templates for error catching and designing Oracle types and table functions to capture errors. This involved refactoring the entire database to incorporate the new error handling standards.",
"Worked with ERP specialists to design and deploy reports using Oracle Reports Developer, creating layouts and designs from scratch and optimizing existing reports by implementing indexes, optimizing joins, and reducing query overhead.",
"Created stories, Models and Applications while using SAP Analytic Cloud. Created graphs, chart and tables.",
"Created HANA calculation, SQV, Procedure and table function.",
"Created DataSources, Info packages, InfoArea, InfoObjects, DSO's, Transformations, and DTP's, Cubes, InfoSets, MultiProvider and BEx queries",
"Data related issues are also reviewed, provide script for data fix for resolution and fix the root cause of the problem by reviewing the back end database procedures and triggers or Forms code that may have resulted in bad data. ",
"Developed a Java Bean (PJC) for Oracle Forms to view and annotate PDF documents (e.g., Bills and Invoices), using a third-party library to enable PDF viewing and note-taking.",
"Working on Zoho CRM, to connect local database and create multiple clients specific dashboard.",
"On boarded new employees, teaching them about schema layouts, coding standards, optimization techniques, and tools like JIRA, GitOra, SourceTree, and VS Code. I also guided them through user stories that informed screen design and report layouts.",
"Assist the Product Manager and Implementation Team by providing effort estimates for new projects and initiatives.",
"Provide expert knowledge on the technical feasibility of the proposed deliverables and technical leadership during the lifecycle of a project/initiative by working with developers to ensure that the detailed technical design is fully understood, and the development initiatives are in line with the intended design.",
"Enhance the existing screens/reports and database program units by adding or changing functionality and logic.",
"Investigate, analyze and document the root cause of issues and resolve defects by providing a permanent solution.",
"Helped in migrating clients from 6i version to 11g.",
"Communicate project status, provide timely escalation and ensure that the project deliverables are on time, within budget and adhere to the corporate quality standards.",
"Jira software is used to manage all user reported issues, application enhancements ,task assignments. Plan, track and manage agile and software development task."],
     "Database and Report Developer/BO Developer:Jan 2010 to August 2015,Corvid Logic:Brampton, Canada": [
"Designed and developed universes for multiple clients (Star Schema).",
"Designed and developed Web Intelligence XI R3 reports for multiple clients.",
"Working experience with small and midsize marketing, sale and Production business clients.",
"Performed ETL (Extract, Transform and Load) Process for Migrate Data from different Data source to Multidimensional Database (The size of data files are 2TB) for one of Marketing Client.",
"Performed Data Mining.",
"Collaborated with a team of three developers to gather, analyze, and document business requirements. I was responsible for creating functional Business Objects Universes and using Webi to generate reports based on these universes.",
"Developed migration plans using BIAR for live system updates and employed Upgrade Management Tools to move repository objects from version 3.x to 4.0. I also converted universes from .unv to .unx formats using the Information Design Tool and verified security settings and user groups post-migration.",
"Updated Webi reports to point to the new universes and created test plans to ensure the functionality of migrated reports.",
"Developed various report types using SAP Business Objects, including measure reports, change reports, highlight reports, drill-down reports, slice-and-dice reports, cross-tab reports, and master-detail reports.",
"Worked with various data sources, including Oracle, Excel, CSV, Access, and MS SQL Server, to extract and transform data in a staging layer before migrating it into a new MS SQL Server instance. The data was then analyzed by developers for trends and statistics.",
"Handled large data files, sometimes exceeding 2TB, for analysis.",
"Built two websites for marketing and purchasing. Both sites utilized an ASP.NET server with C# for backend logic. I designed the database structure, layout, and procedures in MS SQL Server and used HTML and C# to develop the user interface.",
"Gathered reports specifications having multiple sessions with power users.",
"Troubleshoot and fix defects in existing universes and reports.",
"Designed and Developed Database Logical and Physical Model.",
"Designed and Developed Multidimensional Database Model.",
"Developed reports using crystal reports.",
"Transfer Data from MS Access, Flat Files to Oracle.",
"Create VBA Macros to transfer data from MS Access to MS Excel for required layout.",
"Troubleshoot and Support in existing reports.",
"Enhancement of existing reports.",
"Analyzed, designed, created and Implemented database table structures to add, drop, or modify columns, indexes, triggers, or constraints.",
"Developed report while using crystal report and Oracle Report Developer.",
"Designed Database ERD diagram while using Erwin.",
"Maintenance of the Oracle Database and Application environments including testing and installation of application updates, patches and cloning (Solaris Platform).",
"Implementing, operating and maintaining RMAN jobs and repositories.",
"Performance Tuning Oracle SQL Queries.",
"Performance Tuning PL/SQL Procedures.",
"Development of administrative level solutions.",
"Designed, Developed and implemented Asp.net web pages e-commerce applications while using C# as scripting language.",
"Developed a tool in Ms Access 2007 to support and manage the website.",
"Implemented databases on SQL Server 2008 and Windows Server 2008 environment.",
"Tested Cross-browser and interface."],


"Senior Oracle Analyst:June 2004 to June 2007,SUPARCO:Karachi, Pakistan": [
"Led the logical and physical design, implemented and ongoing support of development and production databases.",
"Performance tuning and monitoring of the database.",
"Designing and creation of databases for in-house developed applications.",
"Designing of front end interfaces and deployment of the web-based applications.",
"Up gradation of Oracle 9i database to Oracle 10g release 2.",
"Oracle Streams and Advanced Replication configuration and management.",
"Oracle Recovery Manager (RMAN) Configuration and management for database backup and recovery.",
"Backup and recovery of database.",
"Training of Oracle Products to Clients.",
"Handle other related activities whenever required.",
"Conducted system analyzed, construction, tested and implementation.",
"Analyzed business processes and operational functions to determine system requirements and solutions.",
"Analyzed developed and improved custom reports.",
"Prepared system testing plan and integration testing plan.",
"Enhancement of existing systems.",
"Generation of database objects such as Sequences, Indexes and view for the application.",
"Wrote Technical Specification, Prepared unit case and references data, PL/SQL Packages.",
"Maintenance of existing PL/SQL codes.",
"Test and verified Procedures, Function, Triggers, Property Class for various modules of system.",
"Developed various ad-hoc reports using Crystal Reports, SQL*PLUS, oracle 6i Report.",
"Managed Schema Objects such as tables, Views, Sequences, indexes.",
"Created and Managed database roles and Privileges.",
"Granted role of system privileges to user of the system.",
"Managed, Altered and Created Table space using OEM and SQL*Plus."],

"Senior Oracle PL/SQL Developer:August 2001 to June 2004,SUPARCO:Karachi, Pakistan": [
"Wrote Procedures, Function, Triggers, and Property Class for various modules of System.",
"Wrote Various Complex Queries in SQL Plus.",
"Developed various SQL script for data conversion from legacy system into the oracle Table of new system.",
"Wrote Various PL/SQL Packages to extract data from oracle tables into Text Files (ETL).",
"Created and Managed Schema object like tables, views, indexes, sequences and synonyms.",
"Developed Various Forms and Reports as per user Requirements using Developer 6i, 9i, Crystal Reports.", 
"Created and Managed database roles and privileges and Granted to users.",
"Wrote test cases for Procedures, Function and Packages for functional areas of the system.",
"Wrote Technical Specifications for various functional areas.",
"Wrote SQL to manipulate data."],
     
"Programmer:Jan 1995 to August 2001,Netsoft system:Karachi, Pakistan": [    
"Involved in system analysis and design, system development and documentation, System implementation and maintenance, user support training and installation.",
"Analysis of Modifications as requested by clients.",
"Installation of Software Application Packages for clients.",
"Experience in Design and Development of Visual Basic Applications.",
"Experience in Design and Development of MS-Access.",
"Experience in Designing Reports in MS-Access and linking them through Visual Basic.",
"Experience in Creating Charts in Excel through Visual Basic.",
"Experience in Visual SourceSafe 6 for Version Control.",
"Providing training and support on the software application Packages for clients.",
"Modified application Forms, PL/SQL Packages, Store Procedures, Database Triggers and Reports with Y2k Problems on the various Netsoft Clients systems."]


}